/*
 * Criado por SharpDevelop.
 * Usuário: talba
 * Data: 05/08/2014
 * Hora: 20:38
 * 
 * Para alterar este modelo use Ferramentas | Opções | Codificação | Editar Cabeçalhos Padrão.
 */
using System;
using System.IO;
using System.Text;

namespace ManipulatingFiles
{
	class Program
	{
		public static void Main(string[] args)
		{
			
			try 
			{	
				// criar um arquivo ("append" filemode)
				using (FileStream arquivo = new FileStream(@"..\..\..\arabic-ipsum.txt", FileMode.Append))
				{
					// texto em árabe
					string texto = @"عدم هو أحدث ممثّلة. طوكيو وبولندا ان دنو, عن أراضي الأسيوي والكوري بال, جديدة السادس الألمانية، في وتم. شيء قد وبعض ٢٠٠٤ والكساد. قصف بتطويق وبلجيكا، كل, أم موسكو ليتسنّى اللازمة وصل. دحر أوسع وحرمان بـ, يطول المحور التّحول و أما. حتى يتسنّى الإحتلال والبريطاني عل, ثانية الشمال لمّ ثم. حين لم غضون بالمطالبة, ذات تصفح المضي الإحتفاظ بل, به، مع بفرض المضي.
تسبب ويعزى بالرّد ٣٠ حدى, أم كما الصفحة نورمبرغ. بغزو وتردي الثقيلة أخذ أن, قد الفترة اندلاع والديون إيو, تلك هو بقصف بلاده تحرير. يبق عليها مسؤولية ما. يتعلّق الأرضية ستالينجراد عن قام, جُل نهاية الشهير بل, نفس وحزبه جسيمة العظمى أن. حدى و للحرب انذار, حتى مرجع المانيا إستسلاماً ما.
جعل بل لأداء المتحدة, تم أخذ فرنسا منشوريا الأمريكية. الستار وأكثرها لمّ أي. بـ بالهجوم الإتفاقية يكن, كلّ مسرح لقوات ما. بعتادهم بالتوقيع أم على, به، لم يقوم برلين،. جوزيف المؤلّفة إيو و, غزوه المتاخمة أي يتم. عدد سحقت فرنسية الحاملات ٣٠, حادثة الشمل سليمان، به، إذ, أسابيع الحصار أوراقهم ان بعض. على جدول لإعادة بالهجوم هو.
وإقامة الشتاء، الإتحاد أن دون, وحزبه واستمرت المشتّتون كل قهر. جهة يذكر الأحمر المذابح بـ, ألماني للحكومة مع بحق. دنو نقطة الجبهة التكاليف ان, ربع بل استرجاع تكبّلتها. وبدأت الجديدة، ٣٠ جهة, حدة اعتداء وإيطالي للحكومة ثم. وتنامت بالدبابات هو بال.
أم بزمام إخضاع للحكومة تحت, مع بحق العام، الثالث، البشريةً. بريطانيا الأوربيين وصل قد, ٣٠ وعلى تصرّف الأولية تلك. أخذ و القوى الإنجليز،, ربع برلين عرفها عن. قررت للصين بولندا، مع عام.
إذ مساعدة النزاع وتنامت حدى, إيو إخضاع نورماندي ما. هو تمهيد معزّزة هذا, ان وبدأت الثقيلة أنجلو-فرنسية حشد. بلاده القادة فصل أم. و الى إحكام وقامت عالمية, وهزيمة العالمي والإتحاد كل به،, أن وصل وبالرغم السوفييتي، الإقتصادية. بـ ذات اندلاع الضحايا إستراتيجية, الإنزال الثانية هو ضرب. من تحت ودول منتصف فكانت, الى مع بالرّد تشيكوسلوفاكيا.
تكتيكاً لإنعدام سقط لم, خصوصا بزمام عن وصل, كل هزيمة ونستون والنازي أخذ. بحق وجزر الشرق، عل. إيو بقعة ثانية أن, ثانية استمرار أي كلّ. جُل مرمى وقام قد, بحشد الجنوب الثالث ثم حدة. الساحلية موسوليني هو قام, قادة وبالرغم ثم وفي. مع بال صفحة الدول إستسلاماً.
بل معركة الجنود وضم. حدى ثم يتبقّ اتفاقية, مما وانهاء وأكثرها الفرنسي كل. وسوء اكتوبر وحرمان ان حدة, إيو قد اتفاقية والكساد. إعمار المناوشات أما لم. وسفن معزّزة حرب مع, وبدون اليميني لها عن. عل الى الشهير المتّبعة.
ثم كلّ وجزر حكومة القنابل, حتى بل بسبب السوفييتي،. ليركز القصف وحلفاؤها ومن عن, سياسة الثالث الحربي، نفس كل, حشد عن الإنذار، الإقتصادي. هو وحتى وقامت والنرويج حيث, حاول تشرشل المقاومة كلا ثم. بـ جدول وتقهقر الثانية بلا, بل ٢٠٠٤ وقبل القنابل بين.
أي وفي فرنسا والحزب الشهير. المارق الجنوب الانجليزية لم ضرب, انه القوات ويكيبيديا تشيكوسلوفاكيا تم, بوابة تحرّك ومن ما. حتى فبعد بوزيرها كل, يرتبط الحربية و وضم, بـ جوي غينيا لأداء إظهارإخفاء. يقوم التحالف السوفييتي عام عل.";
					// representação em buffer a ser gravado no arquivo-texto.
					byte[] buffer = new UTF8Encoding().GetBytes(texto);
					// gravando em arquivo
					arquivo.Write(buffer, 0, buffer.Length);
				}
				
			} catch (IOException e) 
			{
				// entrada/saída
				Console.WriteLine("Cannot write file to disk\n{0}", e.Message);
			} catch (UnauthorizedAccessException e) 
			{
				// acesso restrito
				Console.WriteLine("Cannot access file\n{0}", e.Message);
			}
			
			Console.Write("\nPress any key to continue . . . ");
			Console.ReadKey(true);
		}
	}
}